packages/fxa-auth-server/test/local/routes/fixtures/merch_pmt_completed.json

{
  "business": "test@business.example.com",
  "charset": "UTF-8",
  "custom": "inv_000-0",
  "discount": "0.00",
  "first_name": "John",
  "insurance_amount": "0.00",
  "invoice": "inv_000",
  "ipn_track_id": "cab6c6f0a5cb5",
  "item_name": "",
  "item_number": "",
  "last_name": "Doe",
  "mc_currency": "USD",
  "mc_fee": "0.47",
  "mc_gross": "5.99",
  "mp_currency": "USD",
  "mp_custom": "",
  "mp_cycle_start": "17",
  "mp_desc": "Mozilla",
  "mp_id": "B-50T0362377252660W",
  "mp_status": "0",
  "notify_version": "3.9",
  "payer_email": "test@personal.example.com",
  "payer_id": "37Z4TWHK9V3BY",
  "payer_status": "verified",
  "payment_date": "13:56:06 Feb 17, 2021 PST",
  "payment_fee": "0.47",
  "payment_gross": "5.99",
  "payment_status": "Completed",
  "payment_type": "instant",
  "protection_eligibility": "Eligible",
  "quantity": "1",
  "receiver_email": "test@business.example.com",
  "receiver_id": "QR5B237WXX7CY",
  "residence_country": "US",
  "shipping_discount": "0.00",
  "shipping_method": "Default",
  "test_ipn": "1",
  "transaction_subject": "",
  "txn_id": "1ND716707U579832F",
  "txn_type": "merch_pmt",
  "verify_sign": "AS.sXmO3SZlbZsuBgmx57wrfjxyDAtafXn27q8Z9i0KeLQUA0z6tFR3R"
}
