packages/fxa-auth-server/test/local/routes/fixtures/merch_pmt_pending.json

{
  "business": "test@business.example.com",
  "charset": "UTF-8",
  "custom": "inv_000-0",
  "discount": "0.00",
  "first_name": "John",
  "insurance_amount": "0.00",
  "invoice": "inv_000",
  "ipn_track_id": "3c4ebd66a5ef7",
  "item_name": "",
  "item_number": "",
  "last_name": "Doe",
  "mc_currency": "USD",
  "mc_fee": "0.47",
  "mc_gross": "5.99",
  "mp_currency": "USD",
  "mp_custom": "",
  "mp_cycle_start": "11",
  "mp_desc": "Mozilla",
  "mp_id": "B-2KN69933FX948263G",
  "mp_status": "0",
  "notify_version": "3.9",
  "payer_email": "test0@personal.example.com",
  "payer_id": "WP72PEPDZ6HJS",
  "payer_status": "verified",
  "payment_date": "09:38:28 Feb 11, 2021 PST",
  "payment_fee": "0.47",
  "payment_gross": "5.99",
  "payment_status": "Pending",
  "payment_type": "instant",
  "pending_reason": "paymentreview",
  "protection_eligibility": "Ineligible",
  "quantity": "1",
  "receiver_email": "test@business.example.com",
  "receiver_id": "DANXAEVMFXBDE",
  "residence_country": "US",
  "shipping_discount": "0.00",
  "shipping_method": "Default",
  "test_ipn": "1",
  "transaction_subject": "",
  "txn_id": "2TA09271XC591854A",
  "txn_type": "merch_pmt",
  "verify_sign": "AAj28r-DsCmB68hjWYDaiee03WAsApWdZ2iTaUyGlQWSLu92cwTX4bQK"
}
